[{"date": "02/03/2021", "text_desc": "\nInfringement Notice Stage\nJoseph Citizen runs a red light and is captured by a Traffic Camera.\nCamera image is processed and adjudicated by Traffic Camera Industries (TCI) as part of their contract with Vic Government.\n\t", "parties": ["Joseph Citizen"], "artefacts": ["1_Sample_TrafficCameraImageDetails.png"]}, {"date": "03/03/2021", "text_desc": "\nInfringement Notice Stage\nTCI review and adjudicate the image as vehicle belonging to Joseph Citizen. A new Obligation is sent through to Fines Vic.\n\t", "parties": ["TCI"], "artefacts": ["2_ExampleCertifyImage.png"]}, {"date": "03/03/2021", "text_desc": "\nInfringement Notice Stage\nInterface of Fines Vic solution automatically picks up the new obligation sent, performs validations and data matching and identifies existing Debtor account of Joseph Citizen. The new Obligation and applicable fee is added to the Debtor account.\n\t", "parties": ["Fines Vic"], "artefacts": ["3_SAMPLE_SF_1_Debtor360View.png"]}, {"date": "04/03/2021", "text_desc": "\nInfringement Notice Stage\nFines Vic Enforcement Officer receives workflow task to review changes to Debtor account. Officer reviews all key aspects of the total debt and status for the Debtor. Officer reviews current situation of Debtor and previous actions.\nOfficer approves issuing of Infringement Notice for new obligation.\nSystem processes the obligation in background and the notice issued to Debtor and updated into the Debtor account. Debtor also provided with system-generated letter notifying of total debt and payment options or alternatives available.\n\t", "parties": ["Fines Vic"], "artefacts": ["4_1_SAMPLE_SF_2_Debtor360.png", "4_2_SampleInfringementNotice.png", "4_3_SAMPLE_SF_5_ObligationOverview.png"]}, {"date": "10/03/2021", "text_desc": "\nInfringement Notice Stage\nDebtor contacts Fines Vic via telephone.\nEnforcement Officer displays the Debtor Account and overview information. The Fines Vic Enforcement Officer can view the Relationship Map of the Debtor to see all linked Debtor Accounts and history as required. The call is recorded and automatically stored in the Debtors record.\nDebtor asks about WDP with local council (XYZ). Information is emailed to the Debtor via the Contact Centre.\n\t", "parties": ["Fines Vic", "Joseph Citizen"], "artefacts": ["5_1_SAMPLE_SF_4_PaymentOverview.png", "5_2_Example_Call_Recorded.m4a", "5_3_WDP_InfoStatement_ConsentForm_Instructions.png", "5_4_EgRelationshipMap.png"]}, {"date": "15/03/2021", "text_desc": "\nInfringement Notice Stage\nXYZ City Council submits a WDP Application to the Director Fines Vic to sponsor Debtor David Citizen for community service work with their Parks and Gardens Department, as well as formal (mandatory) Drug and Alcohol Counselling provided via the council. This is submitted via the External Agency Portal, and the system automatically performs data matching and links to the Debtor Account for David Citizen.\n\t", "parties": ["XYZ City Council", "David Roleman (XYZ Supervisor)"], "artefacts": ["6_SAMPLE_WDP_Application.png"]}, {"date": "18/03/2021", "text_desc": "\nInfringement Notice Stage\nSystem routes the WDP Application through the WDP Workflow. Fines Vic Enforcement Officer reviews and checks XYZ is an existing Accredited Sponsor, and submits the application via workflow for Director approval.\n\t", "parties": ["Fines Vic"], "artefacts": ["7_Example_SolnIntegration.png"]}, {"date": "19/03/2021", "text_desc": "\nInfringement Notice Stage\nDirector approves the WDP.\nSystem records the approval against Joseph Citizen Debtor Account, and issues the approval notices to both XYZ and Joseph Citizen.\n\t", "parties": ["Fines Vic", "XYZ City Council", "David Roleman (XYZ Supervisor)", "Joseph Citizen"], "artefacts": ["8_SAMPLEPaymentAgmtWDPMockUp.png"]}, {"date": "24/03/2021", "text_desc": "\nInfringement Notice Stage\nJoseph Citizen performs parks and gardens community service work with XYZ City Council.\nDavid Roleman (as XYZ Supervisor) enters the details of Joseph’s work into the WDP Portal of Fines Vic.\nWDP Portal interfaces into the system, and the official “Work Off Rate” community service hours entered are calculated and deducted from Joseph Citizen’s total debt using the Rules Engine of the solution (Vlocity).\n\t", "parties": ["David Roleman (XYZ Supervisor)", "Joseph Citizen"], "artefacts": ["9_1_SAMPLE_FINESVIC_WDP_HoursEntryPortal.png", "9_2_WORK_OFF_RATES_CONFIGURATION.png", "9_3_SAMPLE_SF__6_PaymentOverview_RecalculatedFromWDPPortalHrs.png"]}, {"date": "31/03/2021", "text_desc": "\nInfringement Notice Stage\nDavid Roleman (XYZ Supervisor) receives reports internally that Joseph Citizen has failed to attend scheduled community service work appointments, and has failed to attend mandatory Drug and Alcohol Counselling sessions. David Roleman cannot contact Joseph Citizen despite numerous contact attempts and messages left.\nDavid Roleman escalates to Fines Vic for further action, and to cancel the WDP. This is submitted via the External Portal of the solution and activates a Form that is configured in the Forms Engine of the solution (Youreka).\n\t", "parties": ["David Roleman (XYZ Supervisor)"], "artefacts": ["10_ExampleCancelWDPFormFromXYZ.png"]}, {"date": "01/04/2021", "text_desc": "Enforcement Stage\nFines Vic receives the WDP cancellation request via workflow in the system, and Fines Vic Enforcement Officer reviews and cancels the WDP.\nFines Vic Enforcement Officer escalates the account to Enforcement Stage and issues the Notice of Final Demand to Joseph Citizen.\nSystem automatically updates the Debtor Risk Score, so all Fines Vic teams are aware of status of the Debtor Account.\n\t", "parties": ["Fines Vic"], "artefacts": ["11_1_SF_DebtorRiskScore.png", "11_2_EgNoticeOfFinalDemand"]}, {"date": "May 2021", "text_desc": "\nEnforcement Stage further steps:\n• Joseph Citizen does not respond to Notice of Final Demand.\n• Court Action via Magistrates Court.\n• Custodial sentence applied.\n\t", "parties": ["Fines Vic"], "artefacts": ["The escalation to Magistrates Court etc. is beyond the scope of this scenario."]}]